# TOPICS

- strings, ints, floats, lists, dictionaries
- math operations (i.e. min(), max() ,round(), etc.)
- string operations (i.e. join(), replace(), etc.)

In [114]:
import sys
sys.version

'3.5.2 |Anaconda custom (64-bit)| (default, Jul  5 2016, 11:41:13) [MSC v.1900 64 bit (AMD64)]'

## String Operations

In [25]:
string = 'the quick brown fox Jumped over the lazy brown bear.'

In [26]:
# Return a capitalized version of S, i.e. make the first character have upper case and the rest lower case.
string_capitalized = string.capitalize()
string_capitalized

'The quick brown fox jumped over the lazy brown bear.'

### Center the string with periods on either side, for a total of 79 characters

In [27]:
string_centered = string.center(79, '.')
string_centered

'..............the quick brown fox Jumped over the lazy brown bear..............'

### Count the number of e's between the fifth and last character

In [28]:
string_counted = string.count('e', 4, len(string))
string_counted

4

In [29]:
[
# Are all characters alphabet?
string.isalpha(),

# Are all characters digits?
string.isdigit(),

# Are all characters lower case?
string.islower()
]

[False, False, False]

In [31]:
# Are all chracters alphanumeric?
string_isalnum = string.isalnum()

# Are all characters whitespaces?
string_isalnum = string.isspace()

# Is the string properly titlespaced?
string_istitle = string.istitle()

# Are all the characters uppercase?
string_isupper = string.isupper()

# Return the lengths of string
# len(string)

[string_isalnum, string_isalnum, string_istitle, string_isupper, len(string)]

[False, False, False, False, 52]

## List Operations

In [52]:
# Create a list of simulated data
countries = ["Spain", "Japan", "Kenya", "Tanzania", "Ghana", 'USA']

#  countries = ['Spain', 'Japan', 'Kenya', 'Tanzania', 'Ghana', 'USA']

In [53]:
# Add an item to the end of the list

#Note: If the appending item contains multiple items, it is nested.

countries.append(["Nigeria",'Canada'])

countries.append("Syria")
countries

['Spain',
 'Japan',
 'Kenya',
 'Tanzania',
 'Ghana',
 'USA',
 ['Nigeria', 'Canada'],
 'Syria']

In [54]:
# Add all items of a list to a list

countries.extend(["France", "Switzerland", "China"])
countries

['Spain',
 'Japan',
 'Kenya',
 'Tanzania',
 'Ghana',
 'USA',
 ['Nigeria', 'Canada'],
 'Syria',
 'France',
 'Switzerland',
 'China']

In [55]:
# Insert Italy into the second position of the list countries

countries.insert(1, "Italy"); countries

['Spain',
 'Italy',
 'Japan',
 'Kenya',
 'Tanzania',
 'Ghana',
 'USA',
 ['Nigeria', 'Canada'],
 'Syria',
 'France',
 'Switzerland',
 'China']

In [56]:
#Remove Spain from the list countries

countries.remove("Spain"); countries

['Italy',
 'Japan',
 'Kenya',
 'Tanzania',
 'Ghana',
 'USA',
 ['Nigeria', 'Canada'],
 'Syria',
 'France',
 'Switzerland',
 'China']

In [57]:
# Delete the second item from the list countries

del countries[1]; countries

['Italy',
 'Kenya',
 'Tanzania',
 'Ghana',
 'USA',
 ['Nigeria', 'Canada'],
 'Syria',
 'France',
 'Switzerland',
 'China']

In [58]:
# Remove the third item from the list, and returns it (i.e. "pops it out")
countries.pop(3)

'Ghana'

In [59]:
# Return the index of the second item that matches "Kenya"

kenya = countries.index("Kenya")
kenya

1

In [61]:
#Count all number of times "Kenya" appears in the list countries

kenya_count = countries.count("Kenya")
kenya_count

1

In [62]:
# Reverse the elements of the list

countries.reverse(); countries

['China',
 'Switzerland',
 'France',
 'Syria',
 ['Nigeria', 'Canada'],
 'USA',
 'Tanzania',
 'Kenya',
 'Italy']

In [63]:
#Copy the list, same as countries[:]

countries_copy = countries.copy()
countries_copy

['China',
 'Switzerland',
 'France',
 'Syria',
 ['Nigeria', 'Canada'],
 'USA',
 'Tanzania',
 'Kenya',
 'Italy']

In [64]:
new_states = [] # empty list
states = ['Florida','California','Ohio','Kentucky']

for state in states:
    new_states.append(state)
print(new_states)

['Florida', 'California', 'Ohio', 'Kentucky']

In [ ]:
# String Formatting Operator : %

In [65]:
# One of Python's coolest features is the string format operator %.
# %i - signed decimal integer
# %d - signed decimal integer
# %s - string conversion

name = 'Nielsen'
weight = 900

print("My name is %s and weight is %d pounds!" % (name, weight))

My name is Nielsen and weight is 900 pounds!

In [66]:
# Formating strings using place holders
name = 'Nielsen'
weight = 900

print("My name is {0} and weight is {1} pounds!" .format(name, weight))

My name is Nielsen and weight is 900 pounds!

## Dictionary Basics

In [67]:
# Build a dictionary via brackets, key:value

nielsen_com = {'name' : 'Nielsen', 'staff' : 32, 'url' : 'http://nielsen.com'}
nielsen_com

{'name': 'Nielsen', 'staff': 32, 'url': 'http://nielsen.com'}

In [68]:
# Build a dict via keys
nielsen = {}
nielsen['name'] = 'AC Nielsen'
nielsen['staff'] = '1'
nielsen['url'] = 'http://nielsen.com'
nielsen

{'name': 'AC Nielsen', 'staff': '1', 'url': 'http://nielsen.com'}

In [69]:
# Nesting in dictionaries
# Build a dictionary via brackets

tvStations = {'name' : 'CNN', 'staff' : 32, 'url' : ['http://cnn.com', 'http://bbc.com']}
tvStations

{'name': 'CNN', 'staff': 32, 'url': ['http://cnn.com', 'http://bbc.com']}

In [72]:
# Index the nested list
# Index the second item of the list nested in the url key.

tvStations['url'][1]

'http://bbc.com'

In [73]:
# Create a dictionary with key:value combos
Team = {'Chloe' : 'chloe@nielsen.com',
         'Theophilus' : 'theophilus@nielsen.com',
         'Sikavas' : 'sikavas@nielsen.com',
         'Veronica' : 'veronica@nielsen.com',
         'Louanne' : 'louanne@nielsen.com',
         'Ravi' : 'ravi@nielsen.com'
        }
# Print the values using the key
Team['Theophilus'] , Team['Sikavas'] , Team['Louanne']

('theophilus@nielsen.com', 'sikavas@nielsen.com', 'louanne@nielsen.com')

In [74]:
dishes = {'eggs': 2, 'sausage': 1, 'bacon': 1, 'spam': 500}
keys = dishes.keys()
values = dishes.values()

In [75]:
keys ,values

(dict_keys(['spam', 'bacon', 'sausage', 'eggs']), dict_values([500, 1, 1, 2]))

In [76]:
del dishes['eggs']
del dishes['sausage']
dishes

{'bacon': 1, 'spam': 500}

##  max(), min(), sum() , int() , float() , floor() , ceil()

int : 10          
long  : 51924361L    
float : 15.546

complex : 3i+5j

In [77]:
data = [34, 54, 50, 20, 20]

In [78]:
# Return max value
[max(data),

# Return the min value
min(data),

# Return the total value
sum(data)]

[54, 20, 178]

In [79]:
import math

#Display the value of pi.

math.pi

3.141592653589793

In [80]:
# Display the value of e.

math.e

2.718281828459045

In [81]:
int(math.e)

2

In [84]:
# Truncate (integer conversion)

int(3.292838)

3

In [85]:
# Return the floor of x as a float, the largest integer value less than or equal to x.
math.floor(3.678)

3

In [86]:
# Return the ceiling of x as a float, the smallest integer value greater than or equal to x.
math.ceil(3.678)

4

In [87]:
#Sine, cosine, and tangent

math.sin(2 * math.pi / 180)

0.03489949670250097

In [88]:
# Round to an integrer

round(2.943), round(2.499)

(3, 2)

$$ sin(\frac{2\pi}{180}) $$

In [89]:
# Round by 2 digits

round(math.sin(2 * math.pi / 180), 4) , round(math.e ,3)

(0.0349, 2.718)

## Join And Merge Pandas Dataframe

In [90]:
sep = "-";
phoneNumber = ("813", "555", "6666"); # This is sequence of strings.

print(sep.join( phoneNumber ))

813-555-6666

In [92]:
import pandas as pd

In [93]:
# Create a dataframe
raw_data = {
        'subject_id': ['1', '2', '3', '4', '5'],
        'first_name': ['Alex', 'Amy', 'Allen', 'Alice', 'Ayoung'], 
        'last_name': ['Anderson', 'Ackerman', 'Ali', 'Aoni', 'Atiches']
       }
df_a = pd.DataFrame(raw_data, columns = ['subject_id', 'first_name', 'last_name'])
df_a

  subject_id first_name last_name
0          1       Alex  Anderson
1          2        Amy  Ackerman
2          3      Allen       Ali
3          4      Alice      Aoni
4          5     Ayoung   Atiches

In [94]:
# Create a second dataframe

raw_data = {
        'subject_id': ['4', '5', '6', '7', '8'],
        'first_name': ['Billy', 'Brian', 'Bran', 'Bryce', 'Betty'], 
        'last_name': ['Bonder', 'Black', 'Balwner', 'Brice', 'Btisan']
}
df_b = pd.DataFrame(raw_data, columns = ['subject_id', 'first_name', 'last_name'])
df_b

  subject_id first_name last_name
0          4      Billy    Bonder
1          5      Brian     Black
2          6       Bran   Balwner
3          7      Bryce     Brice
4          8      Betty    Btisan

In [95]:
#Create a third dataframe

raw_data = {
        'subject_id': ['1', '2', '3', '4', '5', '7', '8', '9', '10', '11'],
        'test_id': [51, 15, 15, 61, 16, 14, 15, 1, 61, 16]
}
df_n = pd.DataFrame(raw_data, columns = ['subject_id','test_id'])
df_n

  subject_id  test_id
0          1       51
1          2       15
2          3       15
3          4       61
4          5       16
5          7       14
6          8       15
7          9        1
8         10       61
9         11       16

In [97]:
#Join the two dataframes along rows 
# Concatenate pandas objects along a particular axis with optional set logic
# default : along rows
# axis=1 : columns
df_new = pd.concat([df_a, df_b])
df_new

  subject_id first_name last_name
0          1       Alex  Anderson
1          2        Amy  Ackerman
2          3      Allen       Ali
3          4      Alice      Aoni
4          5     Ayoung   Atiches
0          4      Billy    Bonder
1          5      Brian     Black
2          6       Bran   Balwner
3          7      Bryce     Brice
4          8      Betty    Btisan

* left: use only keys from left frame (SQL: left outer join)
* right: use only keys from right frame (SQL: right outer join)
* outer: use union of keys from both frames (SQL: full outer join)
* inner: use intersection of keys from both frames (SQL: inner join)

In [98]:
# Join the two dataframes along columns

pd.concat([df_a, df_b], axis=1)

  subject_id first_name last_name subject_id first_name last_name
0          1       Alex  Anderson          4      Billy    Bonder
1          2        Amy  Ackerman          5      Brian     Black
2          3      Allen       Ali          6       Bran   Balwner
3          4      Alice      Aoni          7      Bryce     Brice
4          5     Ayoung   Atiches          8      Betty    Btisan

In [99]:
# Merge two dataframes along the subject_id value

pd.merge(df_new, df_n, on='subject_id')

  subject_id first_name last_name  test_id
0          1       Alex  Anderson       51
1          2        Amy  Ackerman       15
2          3      Allen       Ali       15
3          4      Alice      Aoni       61
4          4      Billy    Bonder       61
5          5     Ayoung   Atiches       16
6          5      Brian     Black       16
7          7      Bryce     Brice       14
8          8      Betty    Btisan       15

In [100]:
# Merge with outer join
pd.merge(df_a, df_b, on='subject_id', how='outer')

  subject_id first_name_x last_name_x first_name_y last_name_y
0          1         Alex    Anderson          NaN         NaN
1          2          Amy    Ackerman          NaN         NaN
2          3        Allen         Ali          NaN         NaN
3          4        Alice        Aoni        Billy      Bonder
4          5       Ayoung     Atiches        Brian       Black
5          6          NaN         NaN         Bran     Balwner
6          7          NaN         NaN        Bryce       Brice
7          8          NaN         NaN        Betty      Btisan

In [101]:
# Merge with inner join

"Inner join produces only the set of records that match in both Table A and Table B." 

pd.merge(df_a, df_b, on='subject_id', how='inner')

  subject_id first_name_x last_name_x first_name_y last_name_y
0          4        Alice        Aoni        Billy      Bonder
1          5       Ayoung     Atiches        Brian       Black

## Replace

In [102]:
import pandas as pd
import numpy as np

In [104]:
#Create dataframe
cols = ['first_name', 'last_name', 'age', 'preTestScore', 'postTestScore']

raw_data = {
        'first_name': ['Jason', 'Molly', 'Tina', 'Jake', 'Amy'],
        'last_name': ['Miller', 'Jacobson', 'Ali', 'Milner', 'Cooze'],
        'age': [42, 52, 36, 24, 73],
        'preTestScore': [-999, -999, -999, 2, 1],
        'postTestScore': [2, 2, -999, 2, -999]
}
df = pd.DataFrame(raw_data, columns = cols)
df

  first_name last_name  age  preTestScore  postTestScore
0      Jason    Miller   42          -999              2
1      Molly  Jacobson   52          -999              2
2       Tina       Ali   36          -999           -999
3       Jake    Milner   24             2              2
4        Amy     Cooze   73             1           -999

In [110]:
#Replace all values of -999 with UNKNOWN

df.replace(-999, 'UNKNOWN')  # inplace=True

  first_name last_name  age preTestScore postTestScore
0      Jason    Miller   42      UNKNOWN             2
1      Molly  Jacobson   52      UNKNOWN             2
2       Tina       Ali   36      UNKNOWN       UNKNOWN
3       Jake    Milner   24            2             2
4        Amy     Cooze   73            1       UNKNOWN

In [106]:
address = 'Nielsen Company at Tampa'
address.replace('Tampa','California')

'Nielsen Company at California'

In [113]:
#Replace lower case e's with upper case E's, to a maximum of 2

add_replace = address.replace('e', 'E', 2)
add_replace

'NiElsEn Company at Tampa'

# References

https://www.tutorialspoint.com/python/python_strings.htm

http://chrisalbon.com/python/list_operations.html

https://docs.python.org/2/library/math.html

https://docs.python.org/2/library/stdtypes.html#numeric-types-int-float-long-complex

$$y = x^2 +cos(x)^2 + sin(x)\frac{2b}{x}$$

\begin{array}{*{20}c} {x = \frac{{ - b \pm \sqrt {b^2 - 4ac} }}{{2a}}} & {{\rm{when}}} & {ax^2 + bx + c = 0} \\ \end{array}